* Operations
** Create Streamer Cloud env
#+begin_src sh
curl -i -X POST -H "Content-Type: application/json" -d "{\"name\":\"hyena\",\"info\":\"info\",\"password\":\"password\"}" http://www.pinkumandrill.com:38081/streamer
#+end_src

#+RESULTS:
| HTTP/1.1                                                                                                                                                                                                                                                                                                           | 200                             | OK                |               |         |               |     |
| X-Powered-By:                                                                                                                                                                                                                                                                                                      | Express                         |                   |               |         |               |     |
| Access-Control-Allow-Origin:                                                                                                                                                                                                                                                                                       | *                               |                   |               |         |               |     |
| Access-Control-Allow-Headers:                                                                                                                                                                                                                                                                                      | Origin,                         | X-Requested-With, | Content-Type, | Accept, | Authorization |     |
| Content-Type:                                                                                                                                                                                                                                                                                                      | application/json;               | charset=utf-8     |               |         |               |     |
| Content-Length:                                                                                                                                                                                                                                                                                                    | 312                             |                   |               |         |               |     |
| ETag:                                                                                                                                                                                                                                                                                                              | 138-FvMdP9OWNiBmuPWo+XacJGz7V2Q |                   |               |         |               |     |
| Date:                                                                                                                                                                                                                                                                                                              | Mon,                            | 13                | Apr           |    2020 |      17:43:34 | GMT |
| Connection:                                                                                                                                                                                                                                                                                                        | keep-alive                      |                   |               |         |               |     |
| result":{"n":1,"ok":1},"connection":{"id":1,"host":"www.pinkumandrill.com","port":27017},"ops":[{"name":"hyena","password":"b2f1c90ee17c629867c7a367bb46f2ea4fdc10c87acf22e15e1c2a197057e6a0","info":"info","_id":"5e94a4c5764f91391ab4dc8c"}],"insertedCount":1,"insertedId":"5e94a4c5764f91391ab4dc8c","n":1,"ok |                                 |                   |               |         |               |     |

** Create Streamer Local env
#+begin_src sh
curl -i -X POST -H "Content-Type: application/json" -d "{\"name\":\"rafo\",\"info\":\"info\",\"password\":\"password\"}" http://localhost:38081/streamer
#+end_src

#+RESULTS:
| HTTP/1.1                                                                                                                                                                                                                                                                                                          | 200                             | OK                |               |        |          |     |
| X-Powered-By:                                                                                                                                                                                                                                                                                                     | Express                         |                   |               |        |          |     |
| Access-Control-Allow-Origin:                                                                                                                                                                                                                                                                                      | *                               |                   |               |        |          |     |
| Access-Control-Allow-Headers:                                                                                                                                                                                                                                                                                     | Origin,                         | X-Requested-With, | Content-Type, | Accept |          |     |
| Content-Type:                                                                                                                                                                                                                                                                                                     | application/json;               | charset=utf-8     |               |        |          |     |
| Content-Length:                                                                                                                                                                                                                                                                                                   | 311                             |                   |               |        |          |     |
| ETag:                                                                                                                                                                                                                                                                                                             | 137-Us0JfmAbMUhdulE/EzvHRrDyWqM |                   |               |        |          |     |
| Date:                                                                                                                                                                                                                                                                                                             | Thu,                            | 09                | Apr           |   2020 | 22:32:53 | GMT |
| Connection:                                                                                                                                                                                                                                                                                                       | keep-alive                      |                   |               |        |          |     |
| result":{"n":1,"ok":1},"connection":{"id":2,"host":"www.pinkumandrill.com","port":27017},"ops":[{"name":"rafo","password":"b2f1c90ee17c629867c7a367bb46f2ea4fdc10c87acf22e15e1c2a197057e6a0","info":"info","_id":"5e8fa295cfa761182a421db4"}],"insertedCount":1,"insertedId":"5e8fa295cfa761182a421db4","n":1,"ok |                                 |                   |               |        |          |     |

** Login Local env
#+begin_src sh
curl -i -X POST -H "Content-Type: application/json" -d "{\"name\":\"rafo\",\"info\":\"info\",\"password\":\"password\"}" http://localhost:38081/login
#+end_src

#+RESULTS:
| HTTP/1.1                                                                                                                                                      | 200                            | OK                |               |        |          |     |
| X-Powered-By:                                                                                                                                                 | Express                        |                   |               |        |          |     |
| Access-Control-Allow-Origin:                                                                                                                                  | *                              |                   |               |        |          |     |
| Access-Control-Allow-Headers:                                                                                                                                 | Origin,                        | X-Requested-With, | Content-Type, | Accept |          |     |
| Content-Type:                                                                                                                                                 | application/json;              | charset=utf-8     |               |        |          |     |
| Content-Length:                                                                                                                                               | 161                            |                   |               |        |          |     |
| ETag:                                                                                                                                                         | a1-6PDrU/vFcd78KQCm8WIoOaJzj38 |                   |               |        |          |     |
| Date:                                                                                                                                                         | Thu,                           | 09                | Apr           |   2020 | 22:33:31 | GMT |
| Connection:                                                                                                                                                   | keep-alive                     |                   |               |        |          |     |
| token":"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJkYXRhIjoiZm9vYmFyIiwiaWF0IjoxNTg2NDcxNjExLCJleHAiOjE1ODY0NzUyMTF9.pZxM5SFmbLgASSd1f2RyJGaQ3PZec9CJdQJph1aiCJI |                                |                   |               |        |          |     |

** Search Cloud env
#+begin_src sh
curl -i -X POST -H "Content-Type: application/json" -d "{\"searchKey\":\"a\"}" http://www.pinkumandrill.com:38081/streamer/search
#+end_src

#+RESULTS:
| HTTP/1.1                                                                                                       | 200                            | OK                |               |         |               |     |
| X-Powered-By:                                                                                                  | Express                        |                   |               |         |               |     |
| Access-Control-Allow-Origin:                                                                                   | *                              |                   |               |         |               |     |
| Access-Control-Allow-Headers:                                                                                  | Origin,                        | X-Requested-With, | Content-Type, | Accept, | Authorization |     |
| Content-Type:                                                                                                  | application/json;              | charset=utf-8     |               |         |               |     |
| Content-Length:                                                                                                | 121                            |                   |               |         |               |     |
| ETag:                                                                                                          | 79-T0PHnI/dPNJUANLYeBiiFtn8aQg |                   |               |         |               |     |
| Date:                                                                                                          | Fri,                           | 17                | Apr           |    2020 |      20:15:51 | GMT |
| Connection:                                                                                                    | keep-alive                     |                   |               |         |               |     |
| name":"hyena2","info":"info"},{"name":"admin","info":null},{"name":"aphex","info":null},{"name":"square","info |                                |                   |               |         |               |     |

* TO-DO
- Add Prometheus endpoints 3
- Add nginx reverse proxy with ssl certificate (lets encrypt for free certificate) 5
- Add endpoint for featured 3  
- Add endpoint for search DONE
- Add "playing now" endpoint 5
- Add delete streamer 5
- Add stop streamer button 3
- Add load balancing mechanism for streamers and master - Needs micro services
- Change index h1 for darker headers not selected DONE
- Implement search on index DONE 
- Implement random on index 4
- Implement featured on index 4
- Check if font can be combined for streamers info 5
- Make bigger "password" and "user" on login and signup 5
- Add description to signup 4
- Add search screen DONE
- Add player to index DONE
- Change index page DONE
- Change manage collection page 5
- Create docker files 3 - Needs microservices
- Split microservices 5
- Remove search of navbar DONE
- create newman tests
